Tekla Open API Reference for Tekla Structures 2025
FacetedBrepWithNormals Constructor
 Initializes a new instance of the FacetedBrepWithNormals class.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public FacetedBrepWithNormals(
	Vector[] vertices,
	int[][] outerWires,
	IDictionary<int, int[][]> innerWires,
	Vector[] normals
)
Public Sub New (
	vertices As Vector(),
	outerWires As Integer()(),
	innerWires As IDictionary(Of Integer, Integer()()),
	normals As Vector()
)
Parameters
vertices
Type: Tekla.Structures.Geometry3d.Vector[]
 The vertex geometries.
outerWires
Type: System.Int32[][]
 The outer wires as a two dimensional array. Integer indexes are used for identifying the corresponding vertex for the node in the wire from the array provided by parameter vertices.
innerWires
Type: System.Collections.Generic.IDictionary<Int32, Int32[][]>
 The inner wires also known as inner loops or holes.
normals
Type: Tekla.Structures.Geometry3d.Vector[]
 Normal unit vectors for each vertex in vertices.
See Also
Reference
FacetedBrepWithNormals Class
Tekla.Structures.Geometry3d Namespace